12/data/attachments/51f3c2738863b4e6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_2a71cea8-dc4a-4d38-a89c-c8f488d51794</nif:username>
            <nif:friendToBeAdded>Robert_law_Actions_26235_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>